
// JavaScript Variables Lesson 4

// 1
// Объявите две переменные: admin и name.
// Запишите строку "Джон" в переменную name.
// Скопируйте значение из переменной name в admin.
// Выведите на экран значение admin, используя функцию alert (должна показать «Джон»).

let admin, name;
name = "Джон";
admin = name;
alert(admin);

console.log(admin);

// 2
// Создайте переменную для названия нашей планеты. Как бы вы её назвали?
// Создайте переменную для хранения имени текущего посетителя сайта. Как бы вы назвали такую переменную?

let earth;
let Dima = pageUser(learn.javascript);


// 3
// Можно ли использовать заглавные буквы для имени birthday? 
// А для age? 
// Или одновременно для обеих переменных?

const BIRTHDAY = '18.04.1982'; // Можно, константа не меняется. 

const AGE = someCode(BIRTHDAY); // Нельзя, возраст с годами меняется. 